
## Plan Result




<pre><code>Plan: 12 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;create-schedule&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;direct-listing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;get-sessions&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;update-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;create-schedule&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;direct-listing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-sessions&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;create-schedule&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;direct-listing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;get-sessions&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;update-hearing&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["create-schedule"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Create Schedule"
      + display_name        = "Create Schedule"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "create-schedule"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/schedules"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 201
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["direct-listing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Direct Listing"
      + display_name        = "Direct Listing"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "direct-listing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["get-sessions"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Get Sessions"
      + display_name        = "Get Sessions"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "get-sessions"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/sessions"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }

          + query_parameter {
              + name     = "requestStartDate"
              + required = false
              + type     = "string"
            }
          + query_parameter {
              + name     = "requestEndDate"
              + required = false
              + type     = "string"
            }
          + query_parameter {
              + name     = "requestJudgeType"
              + required = false
              + type     = "string"
            }
          + query_parameter {
              + name     = "requestLocationId"
              + required = false
              + type     = "string"
            }
          + query_parameter {
              + name     = "requestDuration"
              + required = false
              + type     = "string"
            }
          + query_parameter {
              + name     = "requestSessionType"
              + required = false
              + type     = "string"
            }
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-hearing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Update Hearing"
      + display_name        = "Update Hearing"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "update-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/hearings/{hearing-id}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 202
        }

      + template_parameter {
          + name     = "hearing-id"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["create-schedule"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "create-schedule"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["direct-listing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "direct-listing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-sessions"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "get-sessions"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-hearing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "update-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["create-schedule"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "schedules"
      + id               = (known after apply)
      + name             = "schedules"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["direct-listing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "direct-listing"
      + id               = (known after apply)
      + name             = "direct-listing"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["get-sessions"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "sessions"
      + id               = (known after apply)
      + name             = "sessions"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["update-hearing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "hearings"
      + id               = (known after apply)
      + name             = "hearings"
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":54,"Program":"tfcmt","SHA1":"","Vars":{}} -->